{
  "backend/main.mo": "Actor canister managing user profiles, authorization, matchmaking, and core Teen Patti game state with tables, players, and turn logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and requirement IDs for verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files including screens, hooks, and UI components.",
  "frontend/index.css": "Global Tailwind CSS theme definitions and dark-mode variables for casino-style color system.",
  "frontend/index.html": "HTML entry point loading the React app and mounting it into the root div.",
  "frontend/src/App.tsx": "Main React component handling auth, profile setup, and screen routing between lobby, matchmaking, and table interfaces.",
  "frontend/src/components/auth/LoginPanel.tsx": "Login screen UI using Internet Identity with branding and virtual‑coins messaging.",
  "frontend/src/components/layout/AppShell.tsx": "Shared app layout with header, balance display, logout handling, and themed background.",
  "frontend/src/components/lobby/BalanceBadge.tsx": "Small UI badge showing formatted virtual‑coin balance with icon.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal prompting first‑time users to enter and save a display name.",
  "frontend/src/components/responsible/DisclaimerGate.tsx": "Displays a mandatory disclaimer dialog requiring age and virtual‑coin acknowledgements before proceeding.",
  "frontend/src/components/table/ActionBar.tsx": "Renders available game actions based on turn state, player status, and backend mutations.",
  "frontend/src/components/table/CardDisplay.tsx": "Shows three card placeholders with visibility depending on whether the player has seen cards or packed.",
  "frontend/src/components/table/HandHistoryPanel.tsx": "Builds and displays simple hand history events derived from player statuses.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useDisclaimerAck.ts": "Tracks per‑principal disclaimer acknowledgement using localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity load, login, logout, and status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query wrappers for user profile, matchmaking, table state, actions, and settings via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for theming and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/screens/LobbyScreen.tsx": "Displays the lobby with game rules, a play button, and a disclaimer gate before entering matchmaking, using game settings and acknowledgment status.",
  "frontend/src/screens/MatchmakingScreen.tsx": "Automatically joins the matchmaking queue on mount, shows queue size, and navigates to a table when assigned, with an option to cancel back to the lobby.",
  "frontend/src/screens/TableScreen.tsx": "Shows the active game table with players, pot info, turn indicators, and actions, and returns to the lobby if the table becomes inactive.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, storing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, feature requirements, design constraints, and image asset needs for the Teen Patti app."
}