{
  "backend/main.mo": "Defines user profiles, access control, and core game logic including players, tables, state management, and profile persistence.",
  "feature_evidence.json": "Lists implemented PWA, service worker, and Android TWA features with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of every major frontend file including components, screens, hooks, PWA assets, and Android TWA configuration.",
  "frontend/android-twa/app/build.gradle": "Android app module Gradle config defining package metadata, SDK versions, dependencies, and build settings.",
  "frontend/android-twa/app/proguard-rules.pro": "ProGuard rules preserving androidbrowserhelper classes and suppressing warnings.",
  "frontend/android-twa/app/src/main/AndroidManifest.xml": "Android manifest defining permissions, TWA activity setup, intent filters, splash settings, and UI metadata.",
  "frontend/android-twa/app/src/main/java/com/teenpatti/virtualcoins/MainActivity.java": "Main Android activity extending LauncherActivity for TWA startup behavior.",
  "frontend/android-twa/app/src/main/res/values/colors.xml": "Defines color resources used for TWA splash and system bars.",
  "frontend/android-twa/app/src/main/res/values/strings.xml": "String resources including app name, host, and default TWA URL placeholders.",
  "frontend/android-twa/build.gradle": "Top-level Gradle build file configuring repositories and the Android Gradle plugin.",
  "frontend/android-twa/gradle.properties": "Gradle configuration enabling AndroidX, Jetifier, and JVM memory settings.",
  "frontend/android-twa/README.md": "Documentation explaining how to package the web app as an Android TWA with prerequisites and project structure.",
  "frontend/android-twa/settings.gradle": "Configures plugin and dependency repositories and includes the app module.",
  "frontend/android-twa/SETUP_INSTRUCTIONS.md": "Quick setup steps for configuring the TWA project, mainly updating the deployed app URL.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and dark/light theme behavior.",
  "frontend/index.html": "HTML entry point including PWA metadata, manifest links, icons, and root React mount element.",
  "frontend/public/.well-known/assetlinks.json": "Digital Asset Links file used to verify the Android TWA with the website domain.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, theme colors, icons, and display behavior.",
  "frontend/public/sw.js": "Service worker that caches static assets, cleans old caches, and serves requests with a network-first strategy and offline fallbacks.",
  "frontend/src/App.tsx": "Main app component handling auth, profile setup flow, screen navigation, and service worker registration.",
  "frontend/src/components/auth/LoginPanel.tsx": "Displays the login screen with branding and triggers Internet Identity authentication.",
  "frontend/src/components/layout/AppShell.tsx": "App layout with header, logout handler, balance display, and themed background.",
  "frontend/src/components/lobby/BalanceBadge.tsx": "Formats and displays a user’s coin balance inside a badge.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new users to enter a display name and submit their profile.",
  "frontend/src/components/responsible/DisclaimerGate.tsx": "Modal requiring users to confirm age and virtual‑coins disclaimer before proceeding.",
  "frontend/src/components/table/ActionBar.tsx": "Shows available game actions for the current player and triggers table actions via mutations.",
  "frontend/src/components/table/CardDisplay.tsx": "Renders a player’s three cards, showing backs or placeholders based on visibility and pack status.",
  "frontend/src/components/table/HandHistoryPanel.tsx": "Displays a scrollable list of recent hand events derived from the table state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useDisclaimerAck.ts": "Tracks and stores per-user disclaimer acknowledgment in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, matchmaking queue, table state, game actions, and game settings using an actor API.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for theming, including light and dark mode tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pwa/registerServiceWorker.ts": "Implements service worker registration with update checks and provides an unregister helper.",
  "frontend/src/screens/LobbyScreen.tsx": "Renders the lobby UI, shows game rules, enforces disclaimer acknowledgment, and navigates to matchmaking.",
  "frontend/src/screens/MatchmakingScreen.tsx": "Automatically joins the matchmaking queue, displays queue size, and navigates to a table when assigned.",
  "frontend/src/screens/TableScreen.tsx": "Displays the active game table UI, player statuses, pot info, and auto-returns to lobby when the game ends.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing them in sessionStorage, and cleaning parameters from the URL hash. Provides helpers for persisted URL values across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing the project's PWA and Android TWA packaging goals, current features, issues, and requested work state."
}