{
  "kind": "build_request",
  "title": "Restart Android packaging: make the web app PWA-ready and add Trusted Web Activity (TWA) build artifacts for AAB + APK",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the existing React web app installable as a Progressive Web App (PWA) by adding a web app manifest, required icons, and linking them from the HTML entry point.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Han theek hai Dobara Shuru kar do"
        ]
      },
      "acceptanceCriteria": [
        "A `manifest.webmanifest` (or `manifest.json`) exists under the frontend public/static assets and is served by the app.",
        "`frontend/index.html` links the manifest and defines appropriate `theme-color`/app meta tags.",
        "The manifest includes: name, short_name, start_url, display=standalone, background_color, theme_color, and at least one icon >= 192x192 and one icon >= 512x512.",
        "Running the app in Chrome shows it as installable (no critical manifest errors)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a service worker for offline-capable PWA basics (at minimum: cache the app shell and static assets) without changing any immutable frontend hook files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Han theek hai Dobara Shuru kar do"
        ]
      },
      "acceptanceCriteria": [
        "A service worker file is present and registered from the frontend (e.g., from a non-immutable file such as `frontend/src/App.tsx` or a new utility module).",
        "On first load, core static assets are cached; on refresh with the network disabled, the app shell still loads.",
        "Service worker registration can be cleanly updated/unregistered during development (no infinite reload loops)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add Android Trusted Web Activity (TWA) packaging support to produce both an APK (testing) and AAB (Play Store) for the existing deployed web app URL, including Digital Asset Links setup.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Han theek hai Dobara Shuru kar do"
        ]
      },
      "acceptanceCriteria": [
        "Repository includes a dedicated Android/TWA project directory (or equivalent build configuration) that can generate both debug APK and release AAB for the web app URL.",
        "A `/.well-known/assetlinks.json` file is added to the frontend static assets so it can be served from the app origin.",
        "Documentation is included in-repo describing how to: set applicationId/package name, generate signing keys, build APK, build AAB, and verify asset links.",
        "The TWA configuration uses `displayMode: standalone` (or equivalent) and points to the correct start URL."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the web app’s navigation/state handling works correctly inside an Android WebView/TWA context (no reliance on unsupported browser features), and that all user-facing text related to packaging/build instructions is in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "The app launches and remains functional when opened in an in-app browser context (no hard dependency on browser UI chrome).",
        "No new user-facing UI strings are introduced in languages other than English as part of the packaging/PWA changes.",
        "Any new setup/build README or on-screen setup guidance added for Android packaging is written in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (compose instead).",
    "Backend must remain a single Motoko actor in `backend/main.mo`; only create `backend/migration.mo` if a stable-state upgrade is required (not expected for Android packaging).",
    "Do not introduce real-money gambling or payments; the app remains virtual-coins only."
  ],
  "nonGoals": [
    "Implementing native Android features beyond a TWA wrapper (e.g., push notifications, native storage integrations, deep native UI).",
    "Adding third-party authentication beyond Internet Identity.",
    "Adding real-time WebSocket-based updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}