{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PWA readiness + Android TWA wrapper artifacts (APK/AAB) for existing React app",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a web app manifest, required icons, and link them from the HTML entry point to make the app installable as a PWA.",
      "acceptanceCriteria": [
        "A `manifest.webmanifest` (or `manifest.json`) exists under the frontend public/static assets and is served by the app.",
        "`frontend/index.html` links the manifest and defines appropriate `theme-color`/app meta tags.",
        "The manifest includes: name, short_name, start_url, display=standalone, background_color, theme_color, and at least one icon >= 192x192 and one icon >= 512x512.",
        "Running the app in Chrome shows it as installable (no critical manifest errors)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Create the PWA manifest with required fields (name/short_name/start_url/display=standalone/background_color/theme_color) and icon declarations referencing the generated logo assets."
        },
        {
          "path": "frontend/public/assets/generated/app-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the 512x512 PWA icon at this exact path (use the provided generated asset) for manifest icon >=512x512."
        },
        {
          "path": "frontend/public/assets/generated/app-logo.dim_192x192.png",
          "operation": "create",
          "description": "Add a 192x192 PWA icon at this exact path (derived from the provided logo) for manifest icon >=192x192."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Link the manifest and add appropriate PWA meta tags (including theme-color) in the HTML head so Chrome recognizes the app as installable."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add and register a service worker to cache app shell/static assets for basic offline PWA support without changing immutable hook files.",
      "acceptanceCriteria": [
        "A service worker file is present and registered from the frontend (e.g., from a non-immutable file such as `frontend/src/App.tsx` or a new utility module).",
        "On first load, core static assets are cached; on refresh with the network disabled, the app shell still loads.",
        "Service worker registration can be cleanly updated/unregistered during development (no infinite reload loops)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Create a service worker implementing basic app-shell/static-asset caching strategy and safe update behavior (avoid infinite reload loops)."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "create",
          "description": "Add a small utility to register/unregister the service worker (register in production; allow clean unregister in development)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the service worker from a non-immutable file by invoking the registration utility on app mount; ensure registration is environment-safe and does not introduce reload loops."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add Android Trusted Web Activity (TWA) wrapper project artifacts under the frontend workspace and include Digital Asset Links file in static assets.",
      "acceptanceCriteria": [
        "Repository includes a dedicated Android/TWA project directory (or equivalent build configuration) that can generate both debug APK and release AAB for the web app URL.",
        "A `/.well-known/assetlinks.json` file is added to the frontend static assets so it can be served from the app origin.",
        "Documentation is included in-repo describing how to: set applicationId/package name, generate signing keys, build APK, build AAB, and verify asset links.",
        "The TWA configuration uses `displayMode: standalone` (or equivalent) and points to the correct start URL."
      ],
      "file_operations": [
        {
          "path": "frontend/public/.well-known/assetlinks.json",
          "operation": "create",
          "description": "Add Digital Asset Links configuration as a static file so it is served from the app origin at `/.well-known/assetlinks.json`."
        },
        {
          "path": "frontend/android-twa/README.md",
          "operation": "create",
          "description": "Add English documentation for TWA packaging: configuring applicationId/package name, generating signing keys, building debug APK, building release AAB, and verifying asset links."
        },
        {
          "path": "frontend/android-twa/",
          "operation": "create",
          "description": "Create a dedicated Android/TWA wrapper project directory under the frontend workspace with the necessary Gradle/manifest configuration to package the existing deployed web app URL as TWA and output debug APK + release AAB (configured for standalone display mode and correct start URL)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure the app remains functional within Android WebView/TWA contexts and keep all new packaging/setup text in English.",
      "acceptanceCriteria": [
        "The app launches and remains functional when opened in an in-app browser context (no hard dependency on browser UI chrome).",
        "No new user-facing UI strings are introduced in languages other than English as part of the packaging/PWA changes.",
        "Any new setup/build README or on-screen setup guidance added for Android packaging is written in English."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Ensure manifest navigation-related fields are suitable for TWA/WebView (e.g., correct start_url and scope) and keep display mode set to standalone."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add/adjust compatibility meta tags appropriate for installed/in-app contexts (while keeping all visible text unchanged and in English)."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "modify",
          "description": "Ensure service worker behavior is WebView/TWA-safe (no assumptions about browser UI chrome; no aggressive reload/update patterns)."
        },
        {
          "path": "frontend/android-twa/README.md",
          "operation": "modify",
          "description": "Review and ensure all documentation content for Android/TWA packaging is written in English only."
        }
      ]
    }
  ]
}